Catalogs/упШиныУзлыИАгрегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упШиныУзлыИАгрегаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыШинУзловИАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВидыАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыАгрегатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аккумулятор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыШинУзловИАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыШинУзловИАгрегатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МодельТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СезонностьРезины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСезонностьРезины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмерятьНормуВМотоЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьСрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксплуатационнаяНормаКм</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭксплуатационнаяНормаМотоЧасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеНеИспользуетсяПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОприходованоНаСкладПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеУстановленоНаТСПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСписаноПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упШиныУзлыИАгрегаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Представление = НСтр(СтрШаблон("ru = '%1 (серия №%2)'", Данные.Наименование, Данные.Код));
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 51
	|	упШиныУзлыИАгрегаты.Ссылка КАК ШиныУзлыИАгрегаты
	|ИЗ
	|	Справочник.упШиныУзлыИАгрегаты КАК упШиныУзлыИАгрегаты
	|ГДЕ
	|	НЕ упШиныУзлыИАгрегаты.ПометкаУдаления
	|	И упШиныУзлыИАгрегаты.Наименование ПОДОБНО &СтрокаПоиска";
	Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
	Если Параметры.Отбор.Свойство("ТС") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"
			|	НЕ упШиныУзлыИАгрегаты.ПометкаУдаления"	, "
			|	НЕ упШиныУзлыИАгрегаты.ПометкаУдаления
			|	И упШиныУзлыИАгрегаты.Тип.МодельТС В (&МодельТС)" );
		МоделиТС = Новый Массив;
		МоделиТС.Добавить(Справочники.упМоделиТС.ПустаяСсылка());
		МоделиТС.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Отбор.ТС,"Модель"));
		Запрос.УстановитьПараметр("МодельТС",МоделиТС);	
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		спзДанныеВыбора	= Новый СписокЗначений;
		спзДанныеВыбора.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("ШиныУзлыИАгрегаты"));
		ДанныеВыбора = спзДанныеВыбора;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 	
	
#Область ПрограммныйИнтерфейс
	
// Проверка элемента справочника это ШИНА.
//
// Параметры:
//  Элемент  - СправочникСсылка.упШиныУзлыИАгрегаты - Элемент справочника который проверяем.
//
// Возвращаемое значение:
//	Булево - если истина это шина.
//
Функция ЭтоШина(Элемент) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	упШиныУзлыИАгрегаты.Ссылка
	|ИЗ
	|	Справочник.упШиныУзлыИАгрегаты КАК упШиныУзлыИАгрегаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТипыШинУзловИАгрегатов КАК упТипыШинУзловИАгрегатов
	|		ПО упШиныУзлыИАгрегаты.Тип = упТипыШинУзловИАгрегатов.Ссылка
	|ГДЕ
	|	упШиныУзлыИАгрегаты.Ссылка = &Ссылка
	|	И упТипыШинУзловИАгрегатов.Вид = ЗНАЧЕНИЕ(Перечисление.упВидыАгрегатов.Шины)";
	Запрос.УстановитьПараметр("Ссылка",Элемент);
	
	Результат = Истина;
	
	Выборка = Запрос.Выполнить();
	
	Если Выборка.Пустой() Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЭтоШина()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
	// Нет.
	
#КонецОбласти
	
#КонецЕсли
